{
  "backend/main.mo": "Main Motoko actor for the backend that manages user profiles, electricians, work orders, payments, and job applications with role-based access control via mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting that the 'Work Order' tab in WorkOrders.tsx was moved to appear under the 'Verify Application' section instead of the 'Verify' section.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their purpose and notable recent changes.",
  "frontend/index.css": "Root CSS file that defines Tailwind base imports and OKLCH CSS custom properties for light and dark theme color tokens including sidebar variables.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Technical Tech' and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "TanStack Router app setup with lazy-loaded page routes, QueryClient provider, ThemeProvider defaulting to dark mode, and a public /my-bookings route alongside protected admin routes.",
  "frontend/src/components/ApplicationStatusBadge.tsx": "Badge component that maps ApplicationProcessStatus enum values to color-coded CSS classes and human-readable labels including a 'Verified – Awaiting Assignment' state.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation component rendering Portal and Admin link groups with active-state highlighting and dark styling via sidebar-dark CSS class.",
  "frontend/src/components/JobApplicationStepper.tsx": "Multi-step progress indicator component displaying a progress bar, step dots, and step labels for job application flows.",
  "frontend/src/components/LanguageSelector.tsx": "Empty file with no content, likely a placeholder for a future language selector component.",
  "frontend/src/components/Layout.tsx": "Main layout component wrapping the app with a sidebar and sticky header that includes Internet Identity login/logout functionality and displays the user's principal.",
  "frontend/src/components/LoadingFallback.tsx": "Simple full-screen loading spinner component used as a fallback during lazy-loaded route transitions.",
  "frontend/src/components/PaymentStatusBadge.tsx": "Renders a styled badge for payment status values (paid/pending) using CSS class mappings.",
  "frontend/src/components/PriorityBadge.tsx": "Renders a styled badge for numeric priority levels (1–4: Low, Medium, High, Urgent) with corresponding CSS classes.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that shows a login prompt if the user is unauthenticated, a spinner while initializing, or renders child routes via Outlet when authenticated.",
  "frontend/src/components/RatingDisplay.tsx": "Displays a read-only 5-star rating with optional review count, supporting small and medium sizes.",
  "frontend/src/components/RatingInput.tsx": "Interactive 5-star rating input with hover effects and an optional comment textarea for submitting reviews.",
  "frontend/src/components/StatusBadge.tsx": "Renders a styled badge for work order statuses (open, inProgress, completed, cancelled) using CSS class mappings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including CRUD operations for user profiles, electricians, and work orders with automatic cache invalidation.",
  "frontend/src/hooks/useTranslation.ts": "Provides a translation context and hook supporting multiple languages with session storage persistence and English fallback for missing keys.",
  "frontend/src/i18n/translations.ts": "Defines English and Hindi translation strings for all UI text across the app, including navigation, landing page, services, job board, and other sections.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, defines CSS custom properties for the dark-themed design system, and provides badge utility classes for statuses and priorities.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, label/class lookups for work order statuses, payment statuses, priorities, specialities, and qualifications, plus helpers for formatting timestamps and calculating electrician ratings.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that displays summary stats (total orders, completed, electricians, revenue) and a recent orders table using data fetched from work orders and electricians queries.",
  "frontend/src/pages/Electricians.tsx": "Electricians management page that lists all electricians with their ratings and provides dialogs for adding, editing, and deleting electrician records.",
  "frontend/src/pages/JobBoard.tsx": "Displays open work orders as a searchable job listing page where users can apply for jobs and subscribe to job alerts, with login prompts for unauthenticated actions.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with a hero banner, feature highlights, and service category cards linking to the services and jobs pages.",
  "frontend/src/pages/MyBookings.tsx": "Shows the current user's work order bookings split into ongoing and past orders, with accept/decline actions for verified-pending assignments.",
  "frontend/src/pages/Payments.tsx": "Admin payments dashboard displaying revenue summary cards and a list of work orders with an editable dialog to update payment amount, method, and status.",
  "frontend/src/pages/Services.tsx": "Service booking form where customers select a service type, fill in job details and contact info, and submit a new work order via the backend.",
  "frontend/src/pages/WorkOrders.tsx": "React page component for managing work orders, providing tabbed views, search, and dialogs for status updates, ratings, and application verification using various query hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state metadata tracking an existing feature and a pending fix request to move the 'Work Order' tab option under the 'Verify Application' section in the Work Orders page."
}