{
  "backend/main.mo": "Main actor for the backend, defining data types (Electrician, WorkOrder, UserProfile, etc.) and CRUD operations with role-based access control via MixinAuthorization and AccessControl mixins.",
  "backend/migration.mo": "Data migration module that upgrades OldWorkOrder records to NewWorkOrder by adding the missing `customerContactNumber` field (defaulting to empty string).",
  "feature_evidence.json": "Feature evidence report listing two implemented features: removing the 'actor not available' alert on the Book Service page, and adding a Contact Number input field to the booking form.",
  "frontend-file-summaries.txt": "Auto-generated text file containing short summaries of each frontend source file, describing their purpose and recent changes.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Technical Tech' and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all page routes (including a public /my-bookings route), QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/ApplicationStatusBadge.tsx": "Renders a styled badge for application process statuses (pending, verified, accepted, declined, cancelled) with appropriate CSS classes and labels.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation component rendering Portal and Admin link groups with active-state highlighting, using TanStack Router for navigation.",
  "frontend/src/components/JobApplicationStepper.tsx": "Displays a multi-step progress indicator with a progress bar, step dots, and labels for job application flows.",
  "frontend/src/components/LanguageSelector.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping children in a sidebar with a sticky header that includes the logo and an Internet Identity login/logout button.",
  "frontend/src/components/LoadingFallback.tsx": "Simple centered loading spinner component used as a fallback during lazy loading or async operations.",
  "frontend/src/components/PaymentStatusBadge.tsx": "Renders a styled badge for payment statuses (paid or pending) using corresponding CSS classes.",
  "frontend/src/components/PriorityBadge.tsx": "Renders a styled badge for numeric priority levels 1–4 (Low, Medium, High, Urgent) with corresponding CSS classes.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards routes by checking Internet Identity authentication, showing a login prompt or initializing spinner if unauthenticated, otherwise rendering child routes via Outlet.",
  "frontend/src/components/RatingDisplay.tsx": "Displays a read-only star rating (1–5) with optional review count, supporting small and medium sizes.",
  "frontend/src/components/RatingInput.tsx": "Interactive star rating input with hover effects and an optional comment textarea for submitting ratings.",
  "frontend/src/components/StatusBadge.tsx": "Renders a styled badge for work order statuses (open, in progress, completed, cancelled) with corresponding CSS classes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including CRUD operations for user profiles, electricians, work orders, payments, and job applications using the ICP actor.",
  "frontend/src/hooks/useTranslation.ts": "Provides a React context and hook for i18n support, storing the selected language in sessionStorage and resolving translation strings with English fallback.",
  "frontend/src/i18n/translations.ts": "Exports English and Hindi translation strings organized by feature sections (nav, landing, services, jobBoard, etc.) for use with the translation hook.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for the dark-themed design system and utility badge classes for statuses, priorities, and payment states.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, label/class resolution for work order statuses, payment statuses, priorities, specialities, and qualifications, plus rating and timestamp formatting helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that displays summary stats (total/open/completed orders, electricians, revenue) and a recent work orders table using data from React Query hooks.",
  "frontend/src/pages/Electricians.tsx": "Page component for managing electricians with full CRUD operations (add, edit, delete) via dialogs, displaying a list with ratings, qualifications, and work availability using React Query hooks.",
  "frontend/src/pages/JobBoard.tsx": "Public job board page that lists open work orders, supports search filtering, allows authenticated users to apply for jobs, and provides job alert subscription functionality.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with a hero banner, feature highlights, and service category cards that navigate users to the services or jobs pages.",
  "frontend/src/pages/MyBookings.tsx": "User-facing bookings page that displays the current user's work orders split into ongoing and past, with accept/decline actions for verified-pending orders.",
  "frontend/src/pages/Payments.tsx": "Admin payments page showing summary stats (total revenue, pending amounts, paid/pending counts) and a list of work orders with an edit dialog to update payment amount, method, and status.",
  "frontend/src/pages/Services.tsx": "React page for booking a service, allowing users to select a service type, fill in contact/payment details, and submit a work order via the createWorkOrder mutation.",
  "frontend/src/pages/WorkOrders.tsx": "React page for viewing and managing work orders, supporting status updates, accept/decline actions, verification, and rating submissions via tabbed/dialog UI.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, using sessionStorage for persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and keyframe animations for the frontend.",
  "project_state.json": "Project state metadata tracking existing features and pending action requests, specifically to remove the 'actor not available' alert and add a contact number field to the book service form."
}