{
  "backend/main.mo": "Main Motoko actor defining the full backend for the electrician platform, including user profiles, electricians, work orders, job applications, payments, job alert subscriptions, and verification workflows with role-based access control.",
  "backend/migration.mo": "Migration module that upgrades stored electrician and work order records by adding a `verificationStatus` field (defaulting to `#pending`) and expanding `paymentStatus` with `#confirmed` and `#flagged` variants.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding source files, components, test IDs, and confidence levels for the admin portal, routing, verifications page, and query hooks.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of each frontend source file, summarizing their purpose, key changes, and notable implementation details for build planning reference.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles and OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, sidebar, chart, and other UI token colors.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Technical Tech' and mounts the React app via the `/src/main.tsx` module script.",
  "frontend/src/App.tsx": "TanStack Router app defining all client-side routes, with public routes for landing, services, jobs, and bookings, and admin-only routes for dashboard, work orders, electricians, payments, and verifications nested under a `ProtectedRoute` with `adminOnly={true}`.",
  "frontend/src/components/ApplicationStatusBadge.tsx": "Displays a styled badge for an application's process status (pending, verified, accepted, declined, cancelled).",
  "frontend/src/components/AppSidebar.tsx": "Renders the application sidebar with portal navigation links and conditionally shows admin links when the authenticated user is an admin.",
  "frontend/src/components/JobApplicationStepper.tsx": "Renders a multi-step progress indicator with a progress bar, step dots, and labels for job application flows.",
  "frontend/src/components/LanguageSelector.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping pages with a sidebar, sticky header containing login/logout controls, and a scrollable main content area.",
  "frontend/src/components/LoadingFallback.tsx": "Simple full-screen centered loading spinner used as a Suspense or route fallback.",
  "frontend/src/components/PageTransition.tsx": "Wraps children in a fade-in animation div for page transition effects.",
  "frontend/src/components/PaymentStatusBadge.tsx": "Displays a styled badge for a payment's status (paid, confirmed, flagged, pending).",
  "frontend/src/components/PriorityBadge.tsx": "Displays a styled badge indicating work order priority level (Low, Medium, High, Urgent) based on a numeric value.",
  "frontend/src/components/ProcessGuide.tsx": "Collapsible 7-step workflow guide that highlights the current stage based on work order and application statuses.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards routes by requiring authentication and optionally admin privileges, showing appropriate login or access-denied UI otherwise.",
  "frontend/src/components/RatingDisplay.tsx": "Renders a read-only star rating display with optional review count.",
  "frontend/src/components/RatingInput.tsx": "Interactive star rating input with hover effects and an optional comment textarea.",
  "frontend/src/components/StatusBadge.tsx": "A React component that renders a styled badge span for a given WorkOrderStatus, mapping each status to a CSS class and human-readable label.",
  "frontend/src/components/WorkerChecklist.tsx": "A collapsible checklist component for a work order that displays worker task items with checkboxes, a progress bar, and completion tracking via React Query hooks.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, admin checks, electricians, work orders, payments, and checklist items.",
  "frontend/src/hooks/useTranslation.ts": "Provides a TranslationProvider and useTranslation hook that manage the active language (persisted in sessionStorage) and expose a t() function for looking up translated strings.",
  "frontend/src/i18n/translations.ts": "Defines the Language type and a translations object containing English and Hindi string maps organized by UI section (nav, landing, services, jobBoard, etc.).",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a dark-themed design system using CSS custom properties (oklch colors), plus utility badge classes for statuses, priorities, and payment states.",
  "frontend/src/lib/utils.ts": "Utility functions for the frontend including class merging (cn), label/class getters for work order statuses, priorities, payment statuses, specialities, and qualifications, plus helpers for formatting timestamps and calculating electrician ratings.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Admin dashboard page displaying stat cards for work orders (total, open, in-progress, completed), electrician availability, and revenue, along with a recent orders list.",
  "frontend/src/pages/Electricians.tsx": "Electricians management page with a list view and dialogs for adding, editing, and deleting electricians, including form validation and rating display.",
  "frontend/src/pages/JobBoard.tsx": "Public job board page that lists open work orders with search filtering, allows authenticated users to apply for jobs, and supports subscribing to job alert notifications.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with a hero banner, feature pills, and service category cards that navigate users to the services or jobs pages.",
  "frontend/src/pages/MyBookings.tsx": "Customer-facing page displaying ongoing and past work orders with status badges, a worker checklist for in-progress orders, and a dialog to submit worker ratings.",
  "frontend/src/pages/Payments.tsx": "Admin payments dashboard showing revenue stats and a list of all work orders with an edit dialog to update payment amount, method, and status.",
  "frontend/src/pages/Services.tsx": "Service booking page where authenticated users select a repair service type, fill in contact/location details, and submit a fixed-price work order.",
  "frontend/src/pages/Verifications.tsx": "Admin verification page with tabbed views for pending work orders, electricians, job applications, and payments, each supporting approve/reject/flag actions via confirmation dialogs.",
  "frontend/src/pages/WorkOrders.tsx": "React page component that displays work orders in tabbed views (pending, verified, active, completed), with cards supporting verify, assign electrician, accept/decline, and status update actions via TanStack Query mutation hooks.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Barlow Condensed, Inter), OKLCH-based semantic color tokens, border radius variables, glow box shadows, and keyframe animations for accordion, fade, slide, and pulse effects.",
  "project_state.json": "Project state tracking file recording the current version, feature list, and architectural notes for an app with an admin portal under development, including work order verifications, electrician management, and TanStack Query integration."
}