{
  "backend/main.mo": "Main actor for the ICP backend defining user profiles, electricians, work orders, job applications, and related types with access-control-gated query/update methods. Includes mixins for blob storage and authorization.",
  "backend/migration.mo": "Defines the migration module that initializes a new `jobAlertSubscriptions` map when upgrading from the old actor state to the new actor state.",
  "feature_evidence.json": "Feature evidence report mapping three job-board features (simplified apply flow, empty-state Join Us panel, and wired job alert subscription) to their implementing files and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of each frontend source file, serving as a reference for what each component, page, hook, and utility does.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH CSS custom properties for both light and dark themes, including sidebar, chart, and UI token variables.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Technical Tech' and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with lazy-loaded page components, defining protected admin routes (dashboard, work orders, electricians, payments) and public routes (services, jobs, my-bookings, landing).",
  "frontend/src/components/ApplicationStatusBadge.tsx": "Badge component that maps each `ApplicationProcessStatus` enum value to a color-coded label and CSS class for display in the UI.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation component rendering Portal and Admin menu sections with active-state highlighting, dark styling, and the ElectroPro logo in the header.",
  "frontend/src/components/JobApplicationStepper.tsx": "A multi-step progress indicator component that displays a progress bar, step dots, and labels for a job application flow based on current and total step counts.",
  "frontend/src/components/LanguageSelector.tsx": "An empty file with no content or exports.",
  "frontend/src/components/Layout.tsx": "Main app layout component wrapping pages with a sidebar, sticky header containing login/logout button via Internet Identity, and an Outlet for nested routes.",
  "frontend/src/components/LoadingFallback.tsx": "A centered loading spinner with an animated pulse text, used as a fallback UI while content is loading.",
  "frontend/src/components/PaymentStatusBadge.tsx": "A small badge component that displays a styled 'Paid' or 'Pending' label based on a PaymentStatus value.",
  "frontend/src/components/PriorityBadge.tsx": "A small badge component that maps a numeric priority (1–4) to styled labels: Low, Medium, High, or Urgent.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that shows a login prompt with Internet Identity if the user is unauthenticated, or renders child routes via Outlet if authenticated.",
  "frontend/src/components/RatingDisplay.tsx": "A read-only star rating display component that renders filled, half-filled, or empty stars along with a numeric rating and optional review count.",
  "frontend/src/components/RatingInput.tsx": "An interactive star rating input component with hover effects and an optional comment textarea for submitting user reviews.",
  "frontend/src/components/StatusBadge.tsx": "A badge component that maps WorkOrderStatus values (open, inProgress, completed, cancelled) to styled label spans.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout state, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on electricians and work orders, wrapping backend actor calls with useQuery and useMutation and invalidating relevant caches on success.",
  "frontend/src/hooks/useTranslation.ts": "Provides a React context and hook for i18n, storing the selected language in sessionStorage and resolving translation strings with English fallback.",
  "frontend/src/i18n/translations.ts": "Exports a translations object containing English and Hindi string maps organized by UI section (nav, landing, services, jobBoard, etc.).",
  "frontend/src/index.css": "Defines global Tailwind CSS base styles, CSS custom properties for the dark-only theme (colors, radius, sidebar), and utility badge component classes for statuses and priorities.",
  "frontend/src/lib/utils.ts": "Provides utility functions for class merging, label/badge-class resolution for enums (status, priority, speciality), timestamp formatting, and electrician rating calculation from work orders.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Renders an admin dashboard with summary stats (order counts, revenue, staff) and a recent-orders table, fetched via useGetAllWorkOrders and useGetAllElectricians hooks.",
  "frontend/src/pages/Electricians.tsx": "Displays a management page for electricians with CRUD operations (add, edit, delete) via dialogs, showing each electrician's rating calculated from work orders. Uses React Query hooks for data fetching and mutations.",
  "frontend/src/pages/JobBoard.tsx": "Renders a public job board listing open work orders that authenticated workers can apply to, with search filtering, application tracking via localStorage, and job alert subscription support.",
  "frontend/src/pages/LandingPage.tsx": "Static marketing landing page for the Technical Tech app featuring a hero banner, service feature pills, and navigation cards linking to the services and jobs pages.",
  "frontend/src/pages/MyBookings.tsx": "Shows the current user's work order bookings split into ongoing and past sections, with accept/decline actions and links to browse services if no bookings exist.",
  "frontend/src/pages/Payments.tsx": "Displays a payments dashboard with summary stats (total revenue, pending amounts, paid/pending counts) and allows authenticated users to edit payment details for individual work orders.",
  "frontend/src/pages/Services.tsx": "A Services page that lets users select a repair service type (electronic, AC, fridge, electrician) and submit a work order form by choosing an electrician and filling in job details. Uses React Query hooks to fetch electricians and create work orders via the backend.",
  "frontend/src/pages/WorkOrders.tsx": "A WorkOrders management page displaying all work orders with filtering, search, and tabbed views, supporting actions like status updates, electrician assignment, payment updates, ratings, accept/decline, and application verification via dialogs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage fallback for persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Barlow Condensed, Inter), OKLCH-based color tokens, border radii, glow box shadows, and keyframe animations for accordion, fade, slide, and pulse effects.",
  "project_state.json": "Project state metadata describing a job marketplace app, tracking existing implemented features (simplified job application flow, empty-state 'Join Us' panel, subscription wiring) and pending new feature requests including backend job alert subscription storage."
}