{
  "backend/main.mo": "Main actor for the ICP backend defining user profiles, electricians, work orders, and repair service types with role-based access control via mixins for storage and authorization.",
  "backend/migration.mo": "Migration module defining old actor state types and a no-op `run` function for schema migration between canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (renaming 'Television Services' to 'Request a Service', adding repair service type options, and adding preferred education options) to their affected files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing each component's purpose, hooks used, and notable changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including sidebar, chart, and semantic color tokens.",
  "frontend/index.html": "HTML shell with browser tab title set to 'Technical Tech' and a root div mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup with lazy-loaded page components, a protected route wrapper for admin pages, and public routes for the landing page, services, and jobs.",
  "frontend/src/components/AppSidebar.tsx": "Sidebar navigation component with Portal links (Home, Request a Service, Worker Job Apply) and Admin links (Dashboard, Work Orders, Electricians, Payments), with active state highlighting.",
  "frontend/src/components/JobApplicationStepper.tsx": "A multi-step progress indicator component that displays a progress bar, step counter text, and clickable step dots with completed/active/inactive states.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping all pages with a sidebar, sticky header containing the logo and Internet Identity auth controls (login/logout), and a content outlet.",
  "frontend/src/components/LoadingFallback.tsx": "Simple full-screen loading spinner component used as a fallback while lazy-loaded routes or data are being fetched.",
  "frontend/src/components/PaymentStatusBadge.tsx": "Renders a styled inline badge for payment status values ('paid' or 'pending') using CSS class names mapped from the PaymentStatus enum.",
  "frontend/src/components/PriorityBadge.tsx": "Renders a styled inline badge for numeric priority levels (1–4), mapping them to labels like Low, Medium, High, and Urgent.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that shows a login prompt with Internet Identity if the user is unauthenticated, and renders child routes via Outlet when authenticated.",
  "frontend/src/components/RatingDisplay.tsx": "Displays a read-only star rating with support for half-filled stars, a numeric score, and an optional review count.",
  "frontend/src/components/RatingInput.tsx": "Interactive star rating input with hover effects and an optional comment textarea for submitting user reviews.",
  "frontend/src/components/StatusBadge.tsx": "Renders a styled inline badge for WorkOrderStatus values (open, inProgress, completed, cancelled) using mapped CSS class names.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on electricians and work orders, wrapping actor calls with useQuery and useMutation and invalidating relevant caches on success.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with a dark industrial theme (charcoal + amber), custom CSS variables for colors, and utility classes for priority and status badges.",
  "frontend/src/lib/utils.ts": "Exports utility functions for class merging, and label/class helpers for priority, status, payment status, speciality, timestamps, and electrician rating calculations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying summary stat cards for work orders and electricians, a pending revenue alert, and a table of the five most recent work orders.",
  "frontend/src/pages/Electricians.tsx": "Electricians management page with a card grid listing all electricians and dialogs for adding, editing, and deleting electricians, including per-electrician rating display.",
  "frontend/src/pages/JobBoard.tsx": "Multi-step job application page for workers to apply for electrician roles, displaying open/completed work orders and allowing users to submit ratings for completed jobs.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with a hero banner and two navigation cards directing users to either request a repair service or apply for a worker job.",
  "frontend/src/pages/Payments.tsx": "Authenticated payments management page showing payment summaries and a table of completed work orders, with a dialog to edit payment amount, method, and status.",
  "frontend/src/pages/Services.tsx": "Service request form page where customers can select a repair type, provide contact details, and submit a work order assigned to an available electrician.",
  "frontend/src/pages/WorkOrders.tsx": "Admin-style work orders page with search/filter, status and payment editing dialogs, electrician assignment, and customer rating submission for each order.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Barlow Condensed, Inter), OKLCH-based color tokens, border radii, glow shadows, and animation keyframes.",
  "project_state.json": "Project state metadata for a service/worker job platform called 'Technical Tech', tracking existing features (Request a Service page, repair categories, education options) and pending feature requests."
}