{
  "kind": "build_request",
  "title": "Remove actor-not-available alert and add contact number field to Book Service",
  "projectName": "Technical Tech",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the 'actor not available' alert (or any similar error/warning dialog) that appears when a user attempts to use the Book Service option. The Book Service flow should remain accessible and functional without showing this blocking alert.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "book service option actor not available alert don't see please cancel it"
        ]
      },
      "acceptanceCriteria": [
        "No 'actor not available' alert or toast is shown when the user navigates to or interacts with the Book Service page.",
        "The Book Service page loads and renders without any blocking error dialogs related to actor availability.",
        "If the actor is not yet initialized, the form should gracefully wait or show a loading state instead of an alert."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a 'Contact Number' input field to the Book Service form (Services.tsx). This field should allow users to provide a phone/contact number when submitting a service booking request.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "contact number option add book service"
        ]
      },
      "acceptanceCriteria": [
        "The Book Service form includes a clearly labeled 'Contact Number' input field.",
        "The contact number field accepts numeric and standard phone number characters.",
        "The contact number value is submitted along with the rest of the work order data.",
        "The backend WorkOrder data type is updated to include an optional or required contactNumber field.",
        "The contact number is stored and retrievable via the backend.",
        "The contact number is visible in the admin Work Orders view for each booking."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths.",
    "Keep all Motoko logic within the single main actor in backend/main.mo."
  ],
  "nonGoals": [
    "Do not change any other fields or steps in the Book Service flow beyond adding the contact number.",
    "Do not add phone verification or SMS functionality.",
    "Do not alter the admin Work Orders assignment or status update logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}