{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace TV Service with Request a Service section and add education options to Job Apply",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace 'Television Services' navigation option with 'Request a Service' throughout the app including sidebar, landing page card, routing, and page title",
      "acceptanceCriteria": [
        "Sidebar nav item formerly labeled 'Television Services' now reads 'Request a Service'",
        "Landing page navigation card formerly labeled 'Television Services' now reads 'Request a Service'",
        "The services page heading reads 'Request a Service'",
        "All internal references to the old label are updated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppSidebar.tsx",
          "operation": "modify",
          "description": "Update the sidebar navigation item label from 'Television Services' to 'Request a Service'. Preserve the existing route path to /services to maintain compatibility with other components that depend on it."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update the landing page navigation card label from 'Television Services' to 'Request a Service'. Replace the icon reference from 'frontend/public/assets/generated/tv-services-icon.dim_256x256.png' to 'frontend/public/assets/generated/request-service-icon.dim_256x256.png' if a new icon is generated, or reuse the existing icon with updated alt text. Keep the link destination as /services."
        },
        {
          "path": "frontend/src/pages/Services.tsx",
          "operation": "modify",
          "description": "Update the page heading/title from 'Television Services' or similar to 'Request a Service'. Ensure all visible text references to the old label are replaced with 'Request a Service'."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update service type categories on the Request a Service page to include exactly: Television Repair, AC Repair, Fridge Repair, Ceiling Fan Repair, and Table Fan Repair as selectable work detail options",
      "acceptanceCriteria": [
        "Service type/work detail dropdown or selection includes: Television Repair, AC Repair, Fridge Repair, Ceiling Fan Repair, Table Fan Repair",
        "Previous service categories not in this list are removed or replaced",
        "Backend data model/types for work order categories are updated to support these service types",
        "A customer can successfully submit a service request selecting any of these five options"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Services.tsx",
          "operation": "modify",
          "description": "Replace the current service category selection (residential/commercial/industrial) with a service type dropdown or selection field that includes exactly these five options: Television Repair, AC Repair, Fridge Repair, Ceiling Fan Repair, and Table Fan Repair. Update the work order submission form to capture the selected service type and pass it to the backend createWorkOrder method. Remove or replace any previous service category fields that are no longer needed."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add new preferred education options to the worker Job Apply multi-step form: Electronic Commerce Engineering, AC Mechanic, Electrical Engineering, ITI (Electrician Trade), Diploma in Refrigeration & Air Conditioning, and Diploma in Electronics & Communication",
      "acceptanceCriteria": [
        "The preferred education field on the job apply form includes: Electronic Commerce Engineering, AC Mechanic, Electrical Engineering, ITI (Electrician Trade), Diploma in Refrigeration & Air Conditioning, Diploma in Electronics & Communication",
        "All new education options are selectable in the multi-step job application form",
        "Previously existing education options are preserved unless they conflict",
        "The education field data is submitted correctly with the job application"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobBoard.tsx",
          "operation": "modify",
          "description": "Add the following new education options to the 'Preferred Education' field in the job application multi-step form: Electronic Commerce Engineering, AC Mechanic, Electrical Engineering, ITI (Electrician Trade), Diploma in Refrigeration & Air Conditioning, and Diploma in Electronics & Communication. Preserve any existing education options unless they conflict. Ensure the multi-step stepper flow remains intact and that the selected education value is correctly submitted with the work order via createWorkOrder."
        }
      ]
    }
  ]
}